{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "\"": 1,
      "$": 2,
      "%": 3,
      "'": 4,
      "(": 5,
      ")": 6,
      ",": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "?": 22,
      "A": 23,
      "B": 24,
      "C": 25,
      "D": 26,
      "E": 27,
      "F": 28,
      "G": 29,
      "H": 30,
      "I": 31,
      "J": 32,
      "K": 33,
      "L": 34,
      "M": 35,
      "N": 36,
      "O": 37,
      "P": 38,
      "Q": 39,
      "R": 40,
      "S": 41,
      "T": 42,
      "U": 43,
      "V": 44,
      "W": 45,
      "X": 46,
      "Y": 47,
      "[": 48,
      "]": 49,
      "a": 50,
      "b": 51,
      "c": 52,
      "d": 53,
      "e": 54,
      "f": 55,
      "g": 56,
      "h": 57,
      "i": 58,
      "j": 59,
      "k": 60,
      "l": 61,
      "m": 62,
      "n": 63,
      "o": 64,
      "p": 65,
      "q": 66,
      "r": 67,
      "s": 68,
      "t": 69,
      "u": 70,
      "v": 71,
      "w": 72,
      "x": 73,
      "y": 74,
      "z": 75,
      "£": 76,
      "¦": 77,
      "Â": 78,
      "â": 79,
      "Ċ": 80,
      "č": 81,
      "Ġ": 82,
      "Ģ": 83,
      "ĵ": 84,
      "aa": 85,
      "ay": 86,
      "ka": 87,
      "oo": 88,
      "da": 89,
      "ee": 90,
      "ar": 91,
      "in": 92,
      "Ġs": 93,
      "la": 94,
      "ha": 95,
      "ii": 96,
      "Ġw": 97,
      "uu": 98,
      "Ġd": 99,
      "Ġa": 100,
      "Ġay": 101,
      "Ġm": 102,
      "aan": 103,
      "Ġka": 104,
      "Ġk": 105,
      "an": 106,
      "ax": 107,
      "čĊ": 108,
      "Ġla": 109,
      "Ġb": 110,
      "Ġin": 111,
      "iy": 112,
      "Ġah": 113,
      "ta": 114,
      "Ġoo": 115,
      "ad": 116,
      "Ġku": 117,
      "ga": 118,
      "Ġu": 119,
      "ey": 120,
      "ada": 121,
      "ir": 122,
      "Ġwax": 123,
      ".\"": 124,
      "aal": 125,
      "Ġt": 126,
      "Ġuu": 127,
      "is": 128,
      "Ġx": 129,
      "aad": 130,
      "gu": 131,
      "Ġq": 132,
      "Ġee": 133,
      "Ġda": 134,
      "id": 135,
      "Ġc": 136,
      "Ġy": 137,
      "kii": 138,
      "ĠM": 139,
      "si": 140,
      "Ġayaa": 141,
      "Ġh": 142,
      "Ġsh": 143,
      "Ġl": 144,
      "il": 145,
      "Ġj": 146,
      "iyo": 147,
      "na": 148,
      "aab": 149,
      "Ġdha": 150,
      "Ġha": 151,
      "ab": 152,
      "al": 153,
      "een": 154,
      "Ġiyo": 155,
      "el": 156,
      "or": 157,
      "ĠS": 158,
      "Ġsi": 159,
      "Ġshee": 160,
      "Ġdh": 161,
      "Ġmar": 162,
      "\"\"": 163,
      "aha": 164,
      "Ġis": 165,
      "eyn": 166,
      "lka": 167,
      "Ġaan": 168,
      "aam": 169,
      "gay": 170,
      "sa": 171,
      "san": 172,
      "hay": 173,
      "tay": 174,
      "Ġf": 175,
      "iin": 176,
      "ur": 177,
      "aar": 178,
      "Ġma": 179,
      "aas": 180,
      "to": 181,
      "Ġg": 182,
      "Ġloo": 183,
      "im": 184,
      "dd": 185,
      "ib": 186,
      "Ġr": 187,
      "oon": 188,
      "Ġn": 189,
      "Ġta": 190,
      "adan": 191,
      "Ġlagu": 192,
      "dda": 193,
      "er": 194,
      "eey": 195,
      "adda": 196,
      "Ġwaxay": 197,
      "Ġsoo": 198,
      "Ġjir": 199,
      "aasi": 200,
      "ood": 201,
      "Ġmid": 202,
      "Ġbadan": 203,
      "Ġxir": 204,
      "Ġhor": 205,
      "Wax": 206,
      "ba": 207,
      "ig": 208,
      "le": 209,
      "kan": 210,
      "ux": 211,
      "ĠA": 212,
      "Ġsheegay": 213,
      "tii": 214,
      "ayn": 215,
      "arr": 216,
      "Ġugu": 217,
      "Ġmarkii": 218,
      "maal": 219,
      "ob": 220,
      "sh": 221,
      "uur": 222,
      "Ġwaxaa": 223,
      "Ġil": 224,
      "Ġ\"\"": 225,
      "eer": 226,
      "Ġwaa": 227,
      "ĠMar": 228,
      "uxuu": 229,
      "it": 230,
      "ida": 231,
      "lo": 232,
      "ma": 233,
      "aala": 234,
      "Ġkar": 235,
      "Ġqo": 236,
      "mb": 237,
      "oc": 238,
      "ĠG": 239,
      "oomaal": 240,
      "eys": 241,
      "ow": 242,
      "Ġaad": 243,
      "arc": 244,
      "Ġsan": 245,
      "aana": 246,
      "Ġkale": 247,
      "Ġjoo": 248,
      "am": 249,
      "og": 250,
      "ug": 251,
      "ays": 252,
      "Ġbar": 253,
      "ku": 254,
      "ĠD": 255,
      "Ġsoc": 256,
      "Ġbil": 257,
      "ĠSoomaal": 258,
      "kanka": 259,
      "ag": 260,
      "aq": 261,
      "es": 262,
      "ex": 263,
      "iga": 264,
      "se": 265,
      "us": 266,
      "ĠI": 267,
      "ĠT": 268,
      "Ġar": 269,
      "iir": 270,
      "uuq": 271,
      "Ġdoon": 272,
      "Ġlaga": 273,
      "iri": 274,
      "aalka": 275,
      "Ġnoo": 276,
      "ul": 277,
      "un": 278,
      "weyn": 279,
      "Ġ(": 280,
      "Ġ2": 281,
      "ĠC": 282,
      "Ġwuxuu": 283,
      "Ġdib": 284,
      "iya": 285,
      "Ġdamb": 286,
      "ea": 287,
      "ic": 288,
      "ix": 289,
      "ll": 290,
      "mo": 291,
      "yada": 292,
      "Ġ1": 293,
      "eed": 294,
      "arkii": 295,
      "Ġsha": 296,
      "hat": 297,
      "Ġwar": 298,
      "aanka": 299,
      "iyay": 300,
      "Ġtar": 301,
      "Ġdar": 302,
      "siga": 303,
      "eeyay": 304,
      "obo": 305,
      "Ġqof": 306,
      "hii": 307,
      "kay": 308,
      "lay": 309,
      "sad": 310,
      "uq": 311,
      "ĠB": 312,
      "aada": 313,
      "ayo": 314,
      "ooy": 315,
      "Ġkuw": 316,
      "Ġqab": 317,
      "Ġdad": 318,
      "Ġdalka": 319,
      "ĠMarey": 320,
      "Ġ20": 321,
      "haa": 322,
      "ia": 323,
      "ud": 324,
      "ĠK": 325,
      "aac": 326,
      "Ġsid": 327,
      "Ġsam": 328,
      "Ġdaa": 329,
      "Ġayuu": 330,
      "Ġxar": 331,
      "ĠMareykanka": 332,
      "ahay": 333,
      "eh": 334,
      "hiin": 335,
      "lk": 336,
      "sha": 337,
      "Ġga": 338,
      "Ġgu": 339,
      "Ġna": 340,
      "aaf": 341,
      "aag": 342,
      "ayay": 343,
      "eel": 344,
      "iis": 345,
      "Ġinay": 346,
      "add": 347,
      "Ġwaxaana": 348,
      "Ġyiri": 349,
      "Ġsharc": 350,
      "Ġhadda": 351,
      "Ġsheeg": 352,
      "ĠSoomaalida": 353,
      "do": 354,
      "ij": 355,
      "jin": 356,
      "kh": 357,
      "nad": 358,
      "rea": 359,
      "ub": 360,
      "xda": 361,
      "ooda": 362,
      "eeda": 363,
      "Ġsii": 364,
      "Ġwada": 365,
      "Ġwaxa": 366,
      "Ġyee": 367,
      "Ġdhaq": 368,
      "Ġsida": 369,
      "iinta": 370,
      "imaad": 371,
      "Ġxiriir": 372,
      "Ġhore": 373,
      "Ġjoog": 374,
      "aqaan": 375,
      "''": 376,
      "ac": 377,
      "aga": 378,
      "day": 379,
      "maha": 380,
      "no": 381,
      "sta": 382,
      "taa": 383,
      "ter": 384,
      "xii": 385,
      "ys": 386,
      "ĠE": 387,
      "ĠH": 388,
      "ĠR": 389,
      "Ġiy": 390,
      "aya": 391,
      "oob": 392,
      "eeg": 393,
      "ladda": 394,
      "Ġad": 395,
      "Ġaysan": 396,
      "Ġmu": 397,
      "Ġbaa": 398,
      "Ġcarr": 399,
      "Ġdhac": 400,
      "Ġsheekay": 401,
      "ahad": 402,
      "Ġmag": 403,
      "Ġno": 404,
      "Ġsocd": 405,
      "hatar": 406,
      "obot": 407,
      "Ġcarruur": 408,
      "Markii": 409,
      "af": 410,
      "ho": 411,
      "ihiin": 412,
      "mm": 413,
      "soo": 414,
      "ĠL": 415,
      "Ġog": 416,
      "arka": 417,
      "Ġwii": 418,
      "Ġam": 419,
      "Ġmaal": 420,
      "Ġkan": 421,
      "Ġkhatar": 422,
      "Ġlahaa": 423,
      "Ġbal": 424,
      ".\"\"\"": 425,
      "Ġtir": 426,
      "Ġeed": 427,
      "Ġgaar": 428,
      "Ġloogu": 429,
      "Ġxiray": 430,
      "Ġilaa": 431,
      "aalada": 432,
      "ooyin": 433,
      "Ġsharci": 434,
      "aw": 435,
      "dha": 436,
      "dib": 437,
      "edd": 438,
      "kaa": 439,
      "ol": 440,
      "rit": 441,
      "tan": 442,
      "um": 443,
      "ĠJ": 444,
      "ĠU": 445,
      "ayaa": 446,
      "ayaan": 447,
      "Ġsadd": 448,
      "Ġweyn": 449,
      "Ġkala": 450,
      "Ġkadib": 451,
      "Ġkoo": 452,
      "Ġinuu": 453,
      "Ġinaad": 454,
      "aalla": 455,
      "Ġqaad": 456,
      "Ġyahay": 457,
      "Ġyihiin": 458,
      "ĠMin": 459,
      "ilm": 460,
      "Ġdhan": 461,
      "Ġhalka": 462,
      "eli": 463,
      "aamij": 464,
      "Ġfar": 465,
      "Ġrobot": 466,
      "eeyo": 467,
      "sho": 468,
      "Ġshaq": 469,
      "mmaan": 470,
      "Ġkans": 471,
      "ritrea": 472,
      "Ġsaddex": 473,
      "00": 474,
      "ah": 475,
      "as": 476,
      "bo": 477,
      "dh": 478,
      "dis": 479,
      "em": 480,
      "if": 481,
      "nka": 482,
      "naamij": 483,
      "on": 484,
      "uk": 485,
      "ĠO": 486,
      "ĠQ": 487,
      "ĠW": 488,
      "kad": 489,
      "ary": 490,
      "inta": 491,
      "han": 492,
      "iida": 493,
      "Ġdug": 494,
      "Ġab": 495,
      "Ġaf": 496,
      "Ġmuuq": 497,
      "Ġmeel": 498,
      "Ġinta": 499,
      "adoo": 500,
      "Ġwaxy": 501,
      "Ġdaw": 502,
      "Ġyar": 503,
      "sig": 504,
      "Ġleh": 505,
      "ill": 506,
      "ĠSh": 507,
      "Ġmarka": 508,
      "Ġisla": 509,
      "imid": 510,
      "Ġtall": 511,
      "Waxay": 512,
      "Ġilaal": 513,
      "owladda": 514,
      "Ġsanad": 515,
      "Ġbarnaamij": 516,
      "Ġbilaab": 517,
      "Ġbilood": 518,
      "essi": 519,
      "Ġtarxii": 520,
      "shada": 521,
      "Ġgur": 522,
      "ĠEritrea": 523,
      "Ġmagaalada": 524,
      "Ġnoq": 525,
      "Ġsocdaalka": 526,
      "Ġbalse": 527,
      "eddel": 528,
      "kaaga": 529,
      "aj": 530,
      "baab": 531,
      "can": 532,
      "ed": 533,
      "eg": 534,
      "en": 535,
      "ik": 536,
      "lee": 537,
      "mid": 538,
      "nd": 539,
      "ona": 540,
      "tu": 541,
      "aaq": 542,
      "ayd": 543,
      "oos": 544,
      "Ġsu": 545,
      "Ġsab": 546,
      "Ġwal": 547,
      "Ġweli": 548,
      "Ġama": 549,
      "Ġayay": 550,
      "Ġmax": 551,
      "Ġmada": 552,
      "Ġban": 553,
      "iyada": 554,
      "Ġahaa": 555,
      "Ġula": 556,
      "Ġtaasi": 557,
      "Ġciida": 558,
      "Ġyimid": 559,
      "kiisa": 560,
      "ĠMuq": 561,
      "ĠMahad": 562,
      "Ġdhammaan": 563,
      "Ġhadd": 564,
      "absi": 565,
      "Ġdhii": 566,
      "Ġaanan": 567,
      "aama": 568,
      "Ġlooga": 569,
      "Ġtahay": 570,
      "ĠGary": 571,
      "eyso": 572,
      "Ġsano": 573,
      "Ġnool": 574,
      "Ġdadka": 575,
      "Ġ202": 576,
      "Ġdhaqan": 577,
      "Ġiyadoo": 578,
      "Ġadeeg": 579,
      "Ġsheekaysiga": 580,
      "Ġcarruurta": 581,
      "ĠMinn": 582,
      "disho": 583,
      "Ġtallaab": 584,
      "ĠMuqdisho": 585,
      "ĠGaryaqaan": 586,
      "BC": 587,
      "bal": 588,
      "har": 589,
      "kaana": 590,
      "naa": 591,
      "od": 592,
      "qbal": 593,
      "rum": 594,
      "teen": 595,
      "âĢ": 596,
      "Ġ-": 597,
      "ĠF": 598,
      "aysa": 599,
      "ine": 600,
      "inda": 601,
      "Ġsaar": 602,
      "lad": 603,
      "lan": 604,
      "iisa": 605,
      "Ġwad": 606,
      "Ġduu": 607,
      "Ġal": 608,
      "Ġmaad": 609,
      "Ġmaam": 610,
      "Ġkamid": 611,
      "Ġkor": 612,
      "Ġbax": 613,
      "Ġbeddel": 614,
      "Ġahaan": 615,
      "Ġkul": 616,
      "Ġuga": 617,
      "aallo": 618,
      "Ġtaas": 619,
      "isay": 620,
      "ista": 621,
      "Ġxad": 622,
      "Ġxill": 623,
      "Ġqor": 624,
      "Ġqaar": 625,
      "ĠMessi": 626,
      "Ġlaab": 627,
      "Ġhal": 628,
      "Ġhada": 629,
      "Ġhalk": 630,
      "alka": 631,
      "Ġdhig": 632,
      "Ġdhow": 633,
      "Ġaanay": 634,
      "Ġmas": 635,
      "ddo": 636,
      "Ġjiray": 637,
      "Waxaa": 638,
      "tiib": 639,
      "shee": 640,
      "ĠGinda": 641,
      "ayso": 642,
      "Ġsocda": 643,
      "ĠSoomaaliya": 644,
      "ĠTrum": 645,
      "Ġark": 646,
      "Ġarag": 647,
      "Ġtartiib": 648,
      "Ġqofka": 649,
      "sado": 650,
      "ĠBBC": 651,
      "Ġsidoo": 652,
      "Ġxarun": 653,
      "nadkii": 654,
      "Ġwiilka": 655,
      "Ġmaalin": 656,
      "Ġwaxyaab": 657,
      "Ġsabab": 658,
      "Ġhaddii": 659,
      "ĠTrump": 660,
      ",\"\"": 661,
      "CE": 662,
      "Hadda": 663,
      "ai": 664,
      "bad": 665,
      "bur": 666,
      "bit": 667,
      "bix": 668,
      "duu": 669,
      "foon": 670,
      "gga": 671,
      "hi": 672,
      "ihii": 673,
      "kiin": 674,
      "keed": 675,
      "may": 676,
      "mka": 677,
      "mar": 678,
      "ota": 679,
      "rr": 680,
      "shay": 681,
      "tir": 682,
      "tic": 683,
      "ya": 684,
      "yay": 685,
      "Ġi": 686,
      "Ġarr": 687,
      "ĠâĢ": 688,
      "aah": 689,
      "aato": 690,
      "aakiin": 691,
      "kam": 692,
      "eekh": 693,
      "arta": 694,
      "int": 695,
      "Ġsar": 696,
      "Ġsal": 697,
      "Ġsaam": 698,
      "uujin": 699,
      "Ġaw": 700,
      "Ġmuujin": 701,
      "ana": 702,
      "ani": 703,
      "Ġbuk": 704,
      "Ġinaan": 705,
      "iyaar": 706,
      "Ġahayd": 707,
      "gac": 708,
      "Ġtan": 709,
      "Ġtiri": 710,
      "Ġtaag": 711,
      "Ġuusan": 712,
      "Ġqur": 713,
      "Ġqaada": 714,
      "Ġeeg": 715,
      "Ġcaaf": 716,
      "Ġcabsi": 717,
      "Ġcod": 718,
      "Ġhel": 719,
      "Ġlaakiin": 720,
      "Ġjaw": 721,
      "Ġdhax": 722,
      "ele": 723,
      "ell": 724,
      "ĠSt": 725,
      "ĠSha": 726,
      "Ġdhex": 727,
      "Ġmarkaana": 728,
      "Ġisag": 729,
      "Ġfur": 730,
      "Ġfarr": 731,
      "Ġmagac": 732,
      "aasha": 733,
      "Ġgar": 734,
      "imo": 735,
      "Ġraac": 736,
      "Ġjirto": 737,
      "Waxa": 738,
      "Waxaan": 739,
      "ĠAl": 740,
      "tiisa": 741,
      "aaladda": 742,
      "Ġkarin": 743,
      "Ġkaraan": 744,
      "Ġqoys": 745,
      "eysay": 746,
      "Ġjoojin": 747,
      "aysaa": 748,
      "esota": 749,
      "ĠICE": 750,
      "Ġnoola": 751,
      "Ġdambayn": 752,
      "Ġ19": 753,
      "saday": 754,
      "Ġkuwa": 755,
      "Ġkuwaas": 756,
      "Ġ201": 757,
      "Ġdaaw": 758,
      "Ġdaaweyn": 759,
      "Ġsheegtay": 760,
      "Ġyeeshee": 761,
      "Ġxiriira": 762,
      "Ġmuddo": 763,
      "Ġamn": 764,
      "Ġeedey": 765,
      "ĠUK": 766,
      "Ġkooxda": 767,
      "ilmaam": 768,
      "Ġfarii": 769,
      "Ġkansarka": 770,
      "ĠQur": 771,
      "Ġafduu": 772,
      "Ġsugay": 773,
      "Ġdhiigga": 774,
      "Ġduull": 775,
      "Ġhalkaasi": 776,
      "Ġwaxyaabaha": 777,
      "bitaalka": 778,
      "ĠâĢĵ": 779,
      "Ġbukaan": 780,
      "Ġcaafimaad": 781,
      "Ġjawaab": 782,
      "Ġafduub": 783,
      "Ka": 784,
      "Mahad": 785,
      "Sh": 786,
      "To": 787,
      "Wuxuu": 788,
      "ap": 789,
      "bada": 790,
      "dii": 791,
      "daama": 792,
      "et": 793,
      "ew": 794,
      "emb": 795,
      "gel": 796,
      "hu": 797,
      "hor": 798,
      "ika": 799,
      "igay": 800,
      "jab": 801,
      "laam": 802,
      "nug": 803,
      "njab": 804,
      "pol": 805,
      "rig": 806,
      "slaam": 807,
      "xweyn": 808,
      "yo": 809,
      "Ġ'": 810,
      "ĠP": 811,
      "aatay": 812,
      "darr": 813,
      "inayo": 814,
      "Ġsaf": 815,
      "lada": 816,
      "laha": 817,
      "Ġwaan": 818,
      "Ġdiinta": 819,
      "Ġdif": 820,
      "Ġdowladda": 821,
      "Ġmal": 822,
      "Ġkasta": 823,
      "Ġkahor": 824,
      "Ġlac": 825,
      "Ġlaba": 826,
      "Ġbuu": 827,
      "Ġbur": 828,
      "Ġbix": 829,
      "Ġintaa": 830,
      "iyey": 831,
      "Ġahayn": 832,
      "tag": 833,
      "galay": 834,
      "eysan": 835,
      "aalo": 836,
      "aalid": 837,
      "Ġtax": 838,
      "Ġtob": 839,
      "Ġtaallo": 840,
      "Ġtele": 841,
      "Ġtilmaam": 842,
      "ishii": 843,
      "Ġxab": 844,
      "Ġxaaladda": 845,
      "Ġdac": 846,
      "idhi": 847,
      "Ġcus": 848,
      "Ġcul": 849,
      "Ġcilm": 850,
      "Ġyaab": 851,
      "Ġyimaad": 852,
      "Ġyaqaan": 853,
      "Ġyaalla": 854,
      "Ġhub": 855,
      "Ġhoos": 856,
      "Ġshir": 857,
      "naha": 858,
      "aaban": 859,
      "aabada": 860,
      "Ġdhab": 861,
      "Ġdhaw": 862,
      "Ġdhashay": 863,
      "Ġhanjab": 864,
      "aba": 865,
      "eliyay": 866,
      "Ġisku": 867,
      "Ġisbitaalka": 868,
      "Ġfud": 869,
      "Ġmac": 870,
      "Ġgobo": 871,
      "ddu": 872,
      "Ġraj": 873,
      "oonka": 874,
      "Ġtalee": 875,
      "Ġjirka": 876,
      "oodu": 877,
      "Ġhortag": 878,
      "ĠAd": 879,
      "ĠAf": 880,
      "Ġwaaxda": 881,
      "Ġkaro": 882,
      "Ġkartaa": 883,
      "eysaa": 884,
      "arcia": 885,
      "ĠIslaam": 886,
      "ĠTik": 887,
      "Ġdoono": 888,
      "Ġnoocan": 889,
      "ĠChar": 890,
      "Ġwuxuuna": 891,
      "Ġdambe": 892,
      "eapol": 893,
      "Ġdaree": 894,
      "uquuq": 895,
      "Ġqaban": 896,
      "Ġxaru": 897,
      "Ġgalay": 898,
      "aafur": 899,
      "Ġhaddana": 900,
      "Ġsheegeen": 901,
      "Ġjoogo": 902,
      "acter": 903,
      "Ġdhacay": 904,
      "Ġogaan": 905,
      "Ġkoox": 906,
      "Ġqaadi": 907,
      "Ġkansar": 908,
      "ĠOr": 909,
      "Ġabuur": 910,
      "Ġilaaliyo": 911,
      "Ġsanadkii": 912,
      "Ġbarnaamijka": 913,
      "Ġnoqday": 914,
      "onal": 915,
      "aaqa": 916,
      "Ġbandh": 917,
      "Ġciidanka": 918,
      "ĠMinneapol": 919,
      "Ġalbaab": 920,
      "Ġhadal": 921,
      "Ġdhowr": 922,
      "Ġmasaafur": 923,
      "Ġarko": 924,
      "Ġxarunta": 925,
      "Ġsaameyn": 926,
      "Ġawood": 927,
      "Ġisagoo": 928,
      "Ġraaciyay": 929,
      "Ġamni": 930,
      "nugyada": 931,
      "xweyne": 932,
      "Ġdifaac": 933,
      "Ġburbur": 934,
      "Ġtelefoon": 935,
      "Ġcusub": 936,
      "Ġfudud": 937,
      "Ġgobolka": 938,
      "ĠCharacter": 939,
      "ĠMinneapolis": 940,
      "),": 941,
      ".''": 942,
      "Da": 943,
      "Dha": 944,
      "GP": 945,
      "Garcia": 946,
      "Ha": 947,
      "In": 948,
      "Isa": 949,
      "Kad": 950,
      "Mus": 951,
      "Qo": 952,
      "Si": 953,
      "San": 954,
      "Soomaal": 955,
      "Ugu": 956,
      "Waa": 957,
      "av": 958,
      "ala": 959,
      "akam": 960,
      "bi": 961,
      "bee": 962,
      "ban": 963,
      "baar": 964,
      "db": 965,
      "dir": 966,
      "dil": 967,
      "doonka": 968,
      "ek": 969,
      "fan": 970,
      "gaad": 971,
      "haasi": 972,
      "kuu": 973,
      "keen": 974,
      "kood": 975,
      "keeda": 976,
      "li": 977,
      "lin": 978,
      "liga": 979,
      "min": 980,
      "mood": 981,
      "malka": 982,
      "nu": 983,
      "naan": 984,
      "net": 985,
      "olka": 986,
      "ree": 987,
      "rika": 988,
      "ska": 989,
      "tig": 990,
      "tida": 991,
      "toob": 992,
      "usho": 993,
      "yaha": 994,
      "yadan": 995,
      "Ġ,": 996,
      "Ġ3": 997,
      "Ġ7": 998,
      "ĠN": 999,
      "ĠX": 1000,
      "Ġo": 1001,
      "Ġaada": 1002,
      "Ġ''": 1003,
      "ĠWaxay": 1004,
      "aaw": 1005,
      "aaxii": 1006,
      "aysan": 1007,
      "aykanka": 1008,
      "oog": 1009,
      "oola": 1010,
      "daha": 1011,
      "aruur": 1012,
      "ing": 1013,
      "inayaan": 1014,
      "Ġsir": 1015,
      "Ġsayn": 1016,
      "Ġsaaxii": 1017,
      "laddu": 1018,
      "iid": 1019,
      "Ġwa": 1020,
      "Ġway": 1021,
      "Ġwey": 1022,
      "Ġweer": 1023,
      "Ġwaalid": 1024,
      "uul": 1025,
      "Ġdoo": 1026,
      "Ġdow": 1027,
      "Ġdiyaar": 1028,
      "Ġaqbal": 1029,
      "Ġmee": 1030,
      "Ġmana": 1031,
      "aanta": 1032,
      "Ġkac": 1033,
      "Ġkas": 1034,
      "Ġkama": 1035,
      "Ġkeen": 1036,
      "Ġkel": 1037,
      "Ġlaf": 1038,
      "Ġlahay": 1039,
      "Ġlama": 1040,
      "Ġlasoo": 1041,
      "Ġbul": 1042,
      "Ġinka": 1043,
      "iyaha": 1044,
      "iyaas": 1045,
      "iyadda": 1046,
      "Ġahi": 1047,
      "taqbal": 1048,
      "adh": 1049,
      "ado": 1050,
      "adii": 1051,
      "Ġusoo": 1052,
      "Ġunugyada": 1053,
      "eyb": 1054,
      "eyga": 1055,
      "eysa": 1056,
      "adaxweyne": 1057,
      "aale": 1058,
      "aalku": 1059,
      "Ġtij": 1060,
      "Ġtaalla": 1061,
      "Ġtoos": 1062,
      "Ġxan": 1063,
      "Ġxor": 1064,
      "Ġxeer": 1065,
      "Ġxuquuq": 1066,
      "aaday": 1067,
      "Ġqay": 1068,
      "Ġqar": 1069,
      "Ġqaatay": 1070,
      "Ġqeyb": 1071,
      "Ġcaala": 1072,
      "Ġcaruur": 1073,
      "ĠMex": 1074,
      "ĠMadaxweyne": 1075,
      "Ġsharr": 1076,
      "Ġlug": 1077,
      "Ġluuq": 1078,
      "ilaan": 1079,
      "Ġjeer": 1080,
      "Ġhab": 1081,
      "Ġhag": 1082,
      "ĠShiin": 1083,
      "ĠSew": 1084,
      "Ġdhib": 1085,
      "Ġdheer": 1086,
      "Ġdhaaf": 1087,
      "Ġdhigay": 1088,
      "Ġisu": 1089,
      "Ġiska": 1090,
      "Ġisaga": 1091,
      "Ġistic": 1092,
      "eynayay": 1093,
      "Ġfadh": 1094,
      "Ġfilaan": 1095,
      "urka": 1096,
      "Ġraad": 1097,
      "Ġrog": 1098,
      "Ġtag": 1099,
      "Ġtal": 1100,
      "Ġtalo": 1101,
      "Ġjira": 1102,
      "Ġilma": 1103,
      "Ġwaaweyn": 1104,
      "ĠMaraykanka": 1105,
      "ocd": 1106,
      "ĠGrea": 1107,
      "Ġsannadkii": 1108,
      "Ġjooga": 1109,
      "aysay": 1110,
      "Ġbarta": 1111,
      "ĠDr": 1112,
      "ĠDad": 1113,
      "ĠIn": 1114,
      "iirrig": 1115,
      "Ġdoonka": 1116,
      "Ġdoonaan": 1117,
      "ĠChat": 1118,
      "ico": 1119,
      "mond": 1120,
      "Ġ13": 1121,
      "Ġwaree": 1122,
      "Ġwarbix": 1123,
      "Ġdarr": 1124,
      "ooyad": 1125,
      "ĠKolka": 1126,
      "Ġsamayn": 1127,
      "Ġsameeyay": 1128,
      "ehr": 1129,
      "lkooda": 1130,
      "Ġgacan": 1131,
      "Ġgudb": 1132,
      "Ġnaf": 1133,
      "iisu": 1134,
      "iiska": 1135,
      "iisadda": 1136,
      "Ġyeelan": 1137,
      "Ġjoogaan": 1138,
      "ternet": 1139,
      "ĠReg": 1140,
      "Ġiyada": 1141,
      "oobay": 1142,
      "oobaha": 1143,
      "Ġbaah": 1144,
      "Ġbaahan": 1145,
      "Ġmagan": 1146,
      "Ġnolo": 1147,
      "ĠLe": 1148,
      "Ġmaalmood": 1149,
      "Ġtirsan": 1150,
      "ooyinka": 1151,
      "dhaq": 1152,
      "Ġkadibna": 1153,
      "Ġqaaday": 1154,
      "Ġhalkan": 1155,
      "Ġshaqo": 1156,
      "emia": 1157,
      "ĠWuxuu": 1158,
      "Ġdugsiga": 1159,
      "Ġmuuqa": 1160,
      "Ġdawladda": 1161,
      "sigii": 1162,
      "ĠSheekh": 1163,
      "ĠShaaban": 1164,
      "Ġbilaabay": 1165,
      "Ġtarxiilay": 1166,
      "Ġgurig": 1167,
      "Ġnoqon": 1168,
      "eder": 1169,
      "Ġwalba": 1170,
      "Ġmaxaa": 1171,
      "Ġmadax": 1172,
      "Ġciidam": 1173,
      "Ġ2023": 1174,
      "ĠMinnesota": 1175,
      "Ġsaaray": 1176,
      "Ġmaaddaama": 1177,
      "Ġmaamusho": 1178,
      "Ġkore": 1179,
      "keedu": 1180,
      "Ġsare": 1181,
      "Ġqaadan": 1182,
      "ĠStree": 1183,
      "ĠShabaab": 1184,
      "Ġfarriin": 1185,
      "Ġ199": 1186,
      "Ġsugayay": 1187,
      "Ġduullimaad": 1188,
      "Ġafduubka": 1189,
      "Ġkastaba": 1190,
      "Ġbuuxda": 1191,
      "Ġtoban": 1192,
      "Ġxabsiga": 1193,
      "Ġdacw": 1194,
      "Ġcilmi": 1195,
      "Ġshirka": 1196,
      "Ġmacmalka": 1197,
      "Ġtaleefan": 1198,
      "ĠAdem": 1199,
      "ĠAfrika": 1200,
      "ĠIslaamka": 1201,
      "ĠOrmond": 1202,
      "Ġabuurtay": 1203,
      "Ġbandhig": 1204,
      "Ġawoodin": 1205,
      "Ġtelefoonkaaga": 1206,
      "Daweyn": 1207,
      "GPT": 1208,
      "Hase": 1209,
      "Kadib": 1210,
      "Sannadkii": 1211,
      "baarista": 1212,
      "diris": 1213,
      "gaadh": 1214,
      "keenna": 1215,
      "oolaj": 1216,
      "Ġsirdoonka": 1217,
      "Ġsaynis": 1218,
      "Ġkeliya": 1219,
      "Ġbulshada": 1220,
      "Ġtijaabada": 1221,
      "Ġcaalamka": 1222,
      "ĠMexico": 1223,
      "Ġsharrax": 1224,
      "ĠShiinaha": 1225,
      "ĠSewell": 1226,
      "ĠGreat": 1227,
      "ĠChatGPT": 1228,
      "ĠKolkata": 1229,
      "ĠRegehr": 1230,
      "ĠStreet": 1231,
      "\"''": 1232,
      "'d": 1233,
      "AT": 1234,
      "Af": 1235,
      "Bishii": 1236,
      "Dh": 1237,
      "Dr": 1238,
      "Dar": 1239,
      "Dowladda": 1240,
      "GO": 1241,
      "Hor": 1242,
      "Is": 1243,
      "Inka": 1244,
      "Idiris": 1245,
      "Li": 1246,
      "Lif": 1247,
      "Ma": 1248,
      "Messi": 1249,
      "NA": 1250,
      "Qaab": 1251,
      "Socd": 1252,
      "Tan": 1253,
      "Tani": 1254,
      "Waan": 1255,
      "Xar": 1256,
      "at": 1257,
      "ash": 1258,
      "aul": 1259,
      "ashada": 1260,
      "baad": 1261,
      "ber": 1262,
      "beddel": 1263,
      "barta": 1264,
      "ceyn": 1265,
      "daasi": 1266,
      "diya": 1267,
      "dub": 1268,
      "egay": 1269,
      "ebi": 1270,
      "fur": 1271,
      "ge": 1272,
      "gh": 1273,
      "gax": 1274,
      "hr": 1275,
      "haas": 1276,
      "iam": 1277,
      "ilad": 1278,
      "jee": 1279,
      "jir": 1280,
      "kr": 1281,
      "kha": 1282,
      "kaas": 1283,
      "koon": 1284,
      "kaasi": 1285,
      "ktoob": 1286,
      "keyga": 1287,
      "ls": 1288,
      "ly": 1289,
      "lim": 1290,
      "mi": 1291,
      "maad": 1292,
      "msan": 1293,
      "madda": 1294,
      "mayn": 1295,
      "meel": 1296,
      "mihii": 1297,
      "miid": 1298,
      "miyaha": 1299,
      "nay": 1300,
      "nta": 1301,
      "nkii": 1302,
      "noolaj": 1303,
      "our": 1304,
      "odd": 1305,
      "ph": 1306,
      "pp": 1307,
      "qan": 1308,
      "rg": 1309,
      "raan": 1310,
      "ris": 1311,
      "rog": 1312,
      "reeyay": 1313,
      "raac": 1314,
      "sus": 1315,
      "siyada": 1316,
      "siiska": 1317,
      "too": 1318,
      "tee": 1319,
      "tar": 1320,
      "taan": 1321,
      "taas": 1322,
      "taada": 1323,
      "ut": 1324,
      "uw": 1325,
      "uka": 1326,
      "xad": 1327,
      "yar": 1328,
      "yeen": 1329,
      "Ġ.": 1330,
      "Ġ4": 1331,
      "Ġ9": 1332,
      "ĠY": 1333,
      "Ġim": 1334,
      "Ġaala": 1335,
      "Ġaag": 1336,
      "ĠWaxa": 1337,
      "Ġek": 1338,
      "aax": 1339,
      "aay": 1340,
      "aagay": 1341,
      "aatan": 1342,
      "ayaas": 1343,
      "ool": 1344,
      "oomiyaha": 1345,
      "dag": 1346,
      "dan": 1347,
      "aran": 1348,
      "artay": 1349,
      "ina": 1350,
      "ini": 1351,
      "intan": 1352,
      "indiya": 1353,
      "Ġsax": 1354,
      "Ġsaab": 1355,
      "Ġsuur": 1356,
      "latay": 1357,
      "lato": 1358,
      "iic": 1359,
      "iil": 1360,
      "iiq": 1361,
      "iima": 1362,
      "iibo": 1363,
      "iimka": 1364,
      "Ġwan": 1365,
      "Ġwaana": 1366,
      "Ġwaq": 1367,
      "Ġwix": 1368,
      "Ġwaj": 1369,
      "Ġwayd": 1370,
      "uud": 1371,
      "uun": 1372,
      "Ġdii": 1373,
      "Ġdir": 1374,
      "Ġdil": 1375,
      "Ġdood": 1376,
      "Ġdemb": 1377,
      "Ġaj": 1378,
      "Ġas": 1379,
      "Ġadag": 1380,
      "Ġaynu": 1381,
      "Ġmiy": 1382,
      "Ġmur": 1383,
      "Ġmus": 1384,
      "Ġkadd": 1385,
      "Ġkasoo": 1386,
      "Ġkals": 1387,
      "Ġkuu": 1388,
      "Ġkir": 1389,
      "Ġkiis": 1390,
      "Ġkoob": 1391,
      "anac": 1392,
      "aniisadda": 1393,
      "Ġlag": 1394,
      "Ġlala": 1395,
      "Ġlabo": 1396,
      "Ġboo": 1397,
      "Ġbad": 1398,
      "Ġbaab": 1399,
      "Ġbaar": 1400,
      "Ġbood": 1401,
      "Ġbaq": 1402,
      "Ġbishii": 1403,
      "Ġindha": 1404,
      "Ġinternet": 1405,
      "Ġintaas": 1406,
      "iye": 1407,
      "iyaad": 1408,
      "Ġahey": 1409,
      "Ġoogay": 1410,
      "gagax": 1411,
      "Ġugaadh": 1412,
      "Ġwaxaad": 1413,
      "Ġtu": 1414,
      "Ġtuur": 1415,
      "Ġtik": 1416,
      "Ġtidhi": 1417,
      "Ġtegay": 1418,
      "Ġuun": 1419,
      "Ġxid": 1420,
      "Ġxog": 1421,
      "Ġxun": 1422,
      "Ġxas": 1423,
      "Ġxabsi": 1424,
      "Ġxakam": 1425,
      "Ġxoog": 1426,
      "aadda": 1427,
      "aadeen": 1428,
      "gudub": 1429,
      "Ġqal": 1430,
      "Ġqala": 1431,
      "Ġqiyaas": 1432,
      "Ġdal": 1433,
      "Ġdaweyn": 1434,
      "Ġdabee": 1435,
      "idaam": 1436,
      "Ġcis": 1437,
      "Ġcaab": 1438,
      "Ġcel": 1439,
      "Ġcaasi": 1440,
      "Ġcun": 1441,
      "Ġcaanka": 1442,
      "Ġcud": 1443,
      "Ġcadd": 1444,
      "Ġciyaar": 1445,
      "Ġyidhi": 1446,
      "kiis": 1447,
      "ĠMo": 1448,
      "ĠMid": 1449,
      "ĠMiam": 1450,
      "Ġhe": 1451,
      "Ġhay": 1452,
      "Ġheer": 1453,
      "Ġheys": 1454,
      "Ġhog": 1455,
      "Ġhayay": 1456,
      "Ġheli": 1457,
      "Ġhaatan": 1458,
      "Ġlun": 1459,
      "Ġlix": 1460,
      "Ġleeda": 1461,
      "ilka": 1462,
      "Ġjaa": 1463,
      "Ġjii": 1464,
      "Ġjeed": 1465,
      "Ġjeeda": 1466,
      "nal": 1467,
      "nahay": 1468,
      "aabay": 1469,
      "Ġdhalay": 1470,
      "Ġdhalee": 1471,
      "Ġdhalatay": 1472,
      "Ġhase": 1473,
      "abad": 1474,
      "allo": 1475,
      "elona": 1476,
      "orta": 1477,
      "ĠSiyaad": 1478,
      "Ġdhu": 1479,
      "Ġdhim": 1480,
      "Ġdhisay": 1481,
      "Ġdhiirrig": 1482,
      "Ġmarinta": 1483,
      "\"\",": 1484,
      "Ġisoo": 1485,
      "Ġisdil": 1486,
      "Ġiskuu": 1487,
      "Ġismiid": 1488,
      "aamin": 1489,
      "aamac": 1490,
      "gaya": 1491,
      "samin": 1492,
      "sanaa": 1493,
      "sanayn": 1494,
      "sanayay": 1495,
      "sanayaa": 1496,
      "hayeen": 1497,
      "hayaga": 1498,
      "Ġfiic": 1499,
      "aarka": 1500,
      "toy": 1501,
      "Ġgeeyay": 1502,
      "Ġguul": 1503,
      "Ġgoobaha": 1504,
      "Ġgebi": 1505,
      "Ġganac": 1506,
      "imada": 1507,
      "dday": 1508,
      "Ġrab": 1509,
      "oonfur": 1510,
      "Ġnidaam": 1511,
      "Ġtab": 1512,
      "Ġtahr": 1513,
      "Ġtakha": 1514,
      "eri": 1515,
      "eeyeen": 1516,
      "Ġwaxayna": 1517,
      "Ġjiro": 1518,
      "Ġjirta": 1519,
      "Ġhorreeyay": 1520,
      "base": 1521,
      "bakad": 1522,
      "lege": 1523,
      "ĠAI": 1524,
      "ĠAm": 1525,
      "tiij": 1526,
      "maalka": 1527,
      "obaad": 1528,
      "shiisa": 1529,
      "itaanka": 1530,
      "low": 1531,
      "Ġkariimka": 1532,
      "owdo": 1533,
      "Ġaadin": 1534,
      "Ġaadaanka": 1535,
      "arciga": 1536,
      "arcelona": 1537,
      "Ġsannad": 1538,
      "Ġkalena": 1539,
      "ugo": 1540,
      "aystay": 1541,
      "Ġbaraha": 1542,
      "Ġbartiisa": 1543,
      "ĠDowladda": 1544,
      "ĠDonal": 1545,
      "ĠDNA": 1546,
      "Ġbillow": 1547,
      "ĠInd": 1548,
      "Ġargagax": 1549,
      "iiradda": 1550,
      "Ġdoonayay": 1551,
      "Ġlagaga": 1552,
      "Ġnooc": 1553,
      "uly": 1554,
      "untii": 1555,
      "ĠCol": 1556,
      "Ġdibna": 1557,
      "Ġdambeeyay": 1558,
      "Ġ16": 1559,
      "Ġ18": 1560,
      "Ġshan": 1561,
      "Ġshabakad": 1562,
      "Ġwararkii": 1563,
      "Ġwareeg": 1564,
      "Ġdaray": 1565,
      "Ġdartay": 1566,
      "kayaga": 1567,
      "sade": 1568,
      "ĠBarcelona": 1569,
      "aadaha": 1570,
      "Ġkuwo": 1571,
      "Ġkuwaasi": 1572,
      "Ġqaba": 1573,
      "Ġqabo": 1574,
      "Ġqabq": 1575,
      "Ġ2000": 1576,
      "haajir": 1577,
      "ĠKen": 1578,
      "ĠKaniisadda": 1579,
      "ĠKoonfur": 1580,
      "Ġsidd": 1581,
      "Ġsidee": 1582,
      "Ġsameeyo": 1583,
      "ahaya": 1584,
      "Ġgac": 1585,
      "Ġgabad": 1586,
      "Ġnaga": 1587,
      "Ġnagu": 1588,
      "Ġnatiij": 1589,
      "aagin": 1590,
      "Ġsharciga": 1591,
      "Ġsheegen": 1592,
      "don": 1593,
      "Ġyeelay": 1594,
      "Ġyeelato": 1595,
      "Ġdhaqaale": 1596,
      "Ġxiriirkaaga": 1597,
      "Ġjoogto": 1598,
      "yska": 1599,
      "yssa": 1600,
      "ĠHal": 1601,
      "ĠHooyad": 1602,
      "ĠHindiya": 1603,
      "ĠRobot": 1604,
      "ĠRonal": 1605,
      "Ġadiga": 1606,
      "Ġmuhii": 1607,
      "Ġmuhaajir": 1608,
      "Ġbaaq": 1609,
      "Ġdhaca": 1610,
      "ĠLon": 1611,
      "Ġwiilk": 1612,
      "Ġamaba": 1613,
      "Ġkhataraha": 1614,
      "Ġlahaayeen": 1615,
      "Ġball": 1616,
      "Ġtira": 1617,
      "Ġtirtir": 1618,
      "Ġeedeeyay": 1619,
      "Ġeedeeyo": 1620,
      "Ġsharcigu": 1621,
      "dhabarta": 1622,
      "tani": 1623,
      "ĠJaamac": 1624,
      "ĠJuly": 1625,
      "ĠMinesota": 1626,
      "000": 1627,
      "ahooda": 1628,
      "aheri": 1629,
      "dheer": 1630,
      "onel": 1631,
      "ĠOktoob": 1632,
      "kadu": 1633,
      "Ġdugsi": 1634,
      "Ġdugsiyada": 1635,
      "Ġabaal": 1636,
      "Ġafka": 1637,
      "Ġmuuqaal": 1638,
      "Ġmeelood": 1639,
      "Ġwaxyeel": 1640,
      "Ġdaweeyay": 1641,
      "sigiisa": 1642,
      "Ġilaalinayo": 1643,
      "Ġbarnaamijyada": 1644,
      "Ġbilaabo": 1645,
      "Ġtarxiilka": 1646,
      "Ġtarxiilo": 1647,
      "Ġwalaal": 1648,
      "Ġmaxal": 1649,
      "Ġmaxkam": 1650,
      "Ġmadad": 1651,
      "Ġahaatee": 1652,
      "Ġadeegsado": 1653,
      "Ġadeegsaday": 1654,
      "Ġtallaabo": 1655,
      "Ġtallaabooyin": 1656,
      "ĠFeder": 1657,
      "ĠFaran": 1658,
      "Ġwadaagay": 1659,
      "Ġmaadaama": 1660,
      "Ġbaxay": 1661,
      "Ġbaxsado": 1662,
      "Ġahaanba": 1663,
      "Ġkulm": 1664,
      "Ġkulul": 1665,
      "Ġtaasoo": 1666,
      "Ġxadka": 1667,
      "Ġxilli": 1668,
      "Ġxillig": 1669,
      "Ġlaabtay": 1670,
      "Ġhalista": 1671,
      "Ġdhigaan": 1672,
      "Ġaragno": 1673,
      "Ġmaalintii": 1674,
      "Ġsababta": 1675,
      "Haddaba": 1676,
      "baday": 1677,
      "Ġarrimo": 1678,
      "Ġarrintan": 1679,
      "intaan": 1680,
      "Ġtaageer": 1681,
      "Ġeegto": 1682,
      "Ġeegno": 1683,
      "Ġcodsigiisa": 1684,
      "Ġhelin": 1685,
      "Ġfursado": 1686,
      "Ġgaran": 1687,
      "ĠAlyssa": 1688,
      "Ġqoyskayaga": 1689,
      "Ġnoolasha": 1690,
      "Ġ2017": 1691,
      "Ġdaawan": 1692,
      "Ġdaawada": 1693,
      "Ġdaaweynta": 1694,
      "Ġdaaweyntu": 1695,
      "Ġeedeyeen": 1696,
      "Ġfariimo": 1697,
      "Ġfariimaha": 1698,
      "Ġbukaanada": 1699,
      "Ġcaafimaadka": 1700,
      "Sheekh": 1701,
      "Sharciga": 1702,
      "Tok": 1703,
      "diiyay": 1704,
      "gelyo": 1705,
      "ĠPaul": 1706,
      "darro": 1707,
      "darrada": 1708,
      "Ġsafarkii": 1709,
      "Ġlacag": 1710,
      "Ġlacaga": 1711,
      "Ġbixiyay": 1712,
      "Ġtaxan": 1713,
      "Ġtaxaabay": 1714,
      "Ġtilmaamay": 1715,
      "Ġyaabi": 1716,
      "Ġyimaadeen": 1717,
      "Ġyaqaanno": 1718,
      "Ġdhawaad": 1719,
      "Ġrajo": 1720,
      "Ġhortago": 1721,
      "ĠTikTok": 1722,
      "Ġqabanayo": 1723,
      "Ġxarumo": 1724,
      "Ġxarumaha": 1725,
      "Ġalbaabada": 1726,
      "Ġalbaabbada": 1727,
      "Ġdifaaca": 1728,
      "Inaad": 1729,
      "Isaga": 1730,
      "Mustaqbal": 1731,
      "Soomaalida": 1732,
      "avaheri": 1733,
      "tigaas": 1734,
      "Ġof": 1735,
      "Ġaadanaha": 1736,
      "Ġwakh": 1737,
      "Ġweydiiyay": 1738,
      "Ġdoona": 1739,
      "Ġdowlad": 1740,
      "Ġdiyaarad": 1741,
      "Ġmeelaha": 1742,
      "Ġlahayd": 1743,
      "Ġinkasta": 1744,
      "Ġtooska": 1745,
      "Ġxeerar": 1746,
      "Ġxuquuqda": 1747,
      "Ġqayb": 1748,
      "Ġluuqadda": 1749,
      "Ġdhibaato": 1750,
      "Ġdheeraad": 1751,
      "Ġdhigaysa": 1752,
      "Ġfadhiya": 1753,
      "Ġrogrog": 1754,
      "Ġtalogalay": 1755,
      "Ġilmahayaga": 1756,
      "Ġdarro": 1757,
      "Ġgacanta": 1758,
      "Ġnaftiisa": 1759,
      "Ġnolosh": 1760,
      "dhaqaaq": 1761,
      "Ġciidamada": 1762,
      "Ġtaleefankaaga": 1763,
      "GOAT": 1764,
      "Lionel": 1765,
      "Socdaalku": 1766,
      "limiinta": 1767,
      "noolajiyadda": 1768,
      "raantii": 1769,
      "ukaemia": 1770,
      "Ġsaabsan": 1771,
      "Ġwanaag": 1772,
      "Ġwaqtigaas": 1773,
      "Ġwixii": 1774,
      "Ġwajahaya": 1775,
      "Ġwaydiin": 1776,
      "Ġdiray": 1777,
      "Ġdembi": 1778,
      "Ġmurugo": 1779,
      "Ġkaddib": 1780,
      "Ġkalsoon": 1781,
      "Ġbadbaad": 1782,
      "Ġbooday": 1783,
      "Ġaheyd": 1784,
      "Ġugaadhsade": 1785,
      "Ġtuuray": 1786,
      "Ġqalab": 1787,
      "Ġdabeec": 1788,
      "Ġcaabuq": 1789,
      "Ġcaasimadda": 1790,
      "Ġcunaan": 1791,
      "Ġcudurka": 1792,
      "ĠMiami": 1793,
      "Ġleedahay": 1794,
      "Ġdhaleeceyn": 1795,
      "Ġdhiirrigeliyay": 1796,
      "Ġisdilo": 1797,
      "Ġiskuulka": 1798,
      "Ġismiidaamin": 1799,
      "Ġtahriibo": 1800,
      "Ġtakhasus": 1801,
      "Ġsannado": 1802,
      "ĠDonald": 1803,
      "ĠIndia": 1804,
      "ĠCollege": 1805,
      "ĠKenya": 1806,
      "Ġgabadh": 1807,
      "ĠHooyadiis": 1808,
      "ĠRonaldo": 1809,
      "Ġmuhaajiriinta": 1810,
      "ĠLondon": 1811,
      "Ġtirtiro": 1812,
      "ĠOktoobar": 1813,
      "ĠFederaalka": 1814,
      "ĠFaransiiska": 1815
    },
    "merges": [
      [
        "a",
        "a"
      ],
      [
        "a",
        "y"
      ],
      [
        "k",
        "a"
      ],
      [
        "o",
        "o"
      ],
      [
        "d",
        "a"
      ],
      [
        "e",
        "e"
      ],
      [
        "a",
        "r"
      ],
      [
        "i",
        "n"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "l",
        "a"
      ],
      [
        "h",
        "a"
      ],
      [
        "i",
        "i"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "u",
        "u"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "ay"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "aa",
        "n"
      ],
      [
        "Ġ",
        "ka"
      ],
      [
        "Ġ",
        "k"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "x"
      ],
      [
        "č",
        "Ċ"
      ],
      [
        "Ġ",
        "la"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "i",
        "y"
      ],
      [
        "Ġa",
        "h"
      ],
      [
        "t",
        "a"
      ],
      [
        "Ġ",
        "oo"
      ],
      [
        "a",
        "d"
      ],
      [
        "Ġk",
        "u"
      ],
      [
        "g",
        "a"
      ],
      [
        "Ġ",
        "u"
      ],
      [
        "e",
        "y"
      ],
      [
        "a",
        "da"
      ],
      [
        "i",
        "r"
      ],
      [
        "Ġw",
        "ax"
      ],
      [
        ".",
        "\""
      ],
      [
        "aa",
        "l"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "Ġ",
        "uu"
      ],
      [
        "i",
        "s"
      ],
      [
        "Ġ",
        "x"
      ],
      [
        "aa",
        "d"
      ],
      [
        "g",
        "u"
      ],
      [
        "Ġ",
        "q"
      ],
      [
        "Ġ",
        "ee"
      ],
      [
        "Ġ",
        "da"
      ],
      [
        "i",
        "d"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "y"
      ],
      [
        "k",
        "ii"
      ],
      [
        "Ġ",
        "M"
      ],
      [
        "s",
        "i"
      ],
      [
        "Ġay",
        "aa"
      ],
      [
        "Ġ",
        "h"
      ],
      [
        "Ġs",
        "h"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "i",
        "l"
      ],
      [
        "Ġ",
        "j"
      ],
      [
        "iy",
        "o"
      ],
      [
        "n",
        "a"
      ],
      [
        "aa",
        "b"
      ],
      [
        "Ġd",
        "ha"
      ],
      [
        "Ġ",
        "ha"
      ],
      [
        "a",
        "b"
      ],
      [
        "a",
        "l"
      ],
      [
        "ee",
        "n"
      ],
      [
        "Ġ",
        "iyo"
      ],
      [
        "e",
        "l"
      ],
      [
        "o",
        "r"
      ],
      [
        "Ġ",
        "S"
      ],
      [
        "Ġs",
        "i"
      ],
      [
        "Ġsh",
        "ee"
      ],
      [
        "Ġd",
        "h"
      ],
      [
        "Ġm",
        "ar"
      ],
      [
        "\"",
        "\""
      ],
      [
        "a",
        "ha"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "ey",
        "n"
      ],
      [
        "l",
        "ka"
      ],
      [
        "Ġ",
        "aan"
      ],
      [
        "aa",
        "m"
      ],
      [
        "g",
        "ay"
      ],
      [
        "s",
        "a"
      ],
      [
        "s",
        "an"
      ],
      [
        "h",
        "ay"
      ],
      [
        "t",
        "ay"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "i",
        "in"
      ],
      [
        "u",
        "r"
      ],
      [
        "aa",
        "r"
      ],
      [
        "Ġm",
        "a"
      ],
      [
        "aa",
        "s"
      ],
      [
        "t",
        "o"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "Ġl",
        "oo"
      ],
      [
        "i",
        "m"
      ],
      [
        "d",
        "d"
      ],
      [
        "i",
        "b"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "oo",
        "n"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġ",
        "ta"
      ],
      [
        "ada",
        "n"
      ],
      [
        "Ġla",
        "gu"
      ],
      [
        "d",
        "da"
      ],
      [
        "e",
        "r"
      ],
      [
        "ee",
        "y"
      ],
      [
        "ad",
        "da"
      ],
      [
        "Ġwax",
        "ay"
      ],
      [
        "Ġs",
        "oo"
      ],
      [
        "Ġj",
        "ir"
      ],
      [
        "aa",
        "si"
      ],
      [
        "oo",
        "d"
      ],
      [
        "Ġm",
        "id"
      ],
      [
        "Ġb",
        "adan"
      ],
      [
        "Ġx",
        "ir"
      ],
      [
        "Ġh",
        "or"
      ],
      [
        "W",
        "ax"
      ],
      [
        "b",
        "a"
      ],
      [
        "i",
        "g"
      ],
      [
        "l",
        "e"
      ],
      [
        "ka",
        "n"
      ],
      [
        "u",
        "x"
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "Ġshee",
        "gay"
      ],
      [
        "t",
        "ii"
      ],
      [
        "ay",
        "n"
      ],
      [
        "ar",
        "r"
      ],
      [
        "Ġu",
        "gu"
      ],
      [
        "Ġmar",
        "kii"
      ],
      [
        "m",
        "aal"
      ],
      [
        "o",
        "b"
      ],
      [
        "s",
        "h"
      ],
      [
        "uu",
        "r"
      ],
      [
        "Ġwax",
        "aa"
      ],
      [
        "Ġ",
        "il"
      ],
      [
        "Ġ",
        "\"\""
      ],
      [
        "ee",
        "r"
      ],
      [
        "Ġw",
        "aa"
      ],
      [
        "ĠM",
        "ar"
      ],
      [
        "ux",
        "uu"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "da"
      ],
      [
        "l",
        "o"
      ],
      [
        "m",
        "a"
      ],
      [
        "aa",
        "la"
      ],
      [
        "Ġka",
        "r"
      ],
      [
        "Ġq",
        "o"
      ],
      [
        "m",
        "b"
      ],
      [
        "o",
        "c"
      ],
      [
        "Ġ",
        "G"
      ],
      [
        "oo",
        "maal"
      ],
      [
        "ey",
        "s"
      ],
      [
        "o",
        "w"
      ],
      [
        "Ġ",
        "aad"
      ],
      [
        "ar",
        "c"
      ],
      [
        "Ġs",
        "an"
      ],
      [
        "aan",
        "a"
      ],
      [
        "Ġka",
        "le"
      ],
      [
        "Ġj",
        "oo"
      ],
      [
        "a",
        "m"
      ],
      [
        "o",
        "g"
      ],
      [
        "u",
        "g"
      ],
      [
        "ay",
        "s"
      ],
      [
        "Ġb",
        "ar"
      ],
      [
        "k",
        "u"
      ],
      [
        "Ġ",
        "D"
      ],
      [
        "Ġs",
        "oc"
      ],
      [
        "Ġb",
        "il"
      ],
      [
        "ĠS",
        "oomaal"
      ],
      [
        "kan",
        "ka"
      ],
      [
        "a",
        "g"
      ],
      [
        "a",
        "q"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "x"
      ],
      [
        "i",
        "ga"
      ],
      [
        "s",
        "e"
      ],
      [
        "u",
        "s"
      ],
      [
        "Ġ",
        "I"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "Ġ",
        "ar"
      ],
      [
        "ii",
        "r"
      ],
      [
        "uu",
        "q"
      ],
      [
        "Ġd",
        "oon"
      ],
      [
        "Ġla",
        "ga"
      ],
      [
        "ir",
        "i"
      ],
      [
        "aal",
        "ka"
      ],
      [
        "Ġn",
        "oo"
      ],
      [
        "u",
        "l"
      ],
      [
        "u",
        "n"
      ],
      [
        "w",
        "eyn"
      ],
      [
        "Ġ",
        "("
      ],
      [
        "Ġ",
        "2"
      ],
      [
        "Ġ",
        "C"
      ],
      [
        "Ġw",
        "uxuu"
      ],
      [
        "Ġd",
        "ib"
      ],
      [
        "iy",
        "a"
      ],
      [
        "Ġda",
        "mb"
      ],
      [
        "e",
        "a"
      ],
      [
        "i",
        "c"
      ],
      [
        "i",
        "x"
      ],
      [
        "l",
        "l"
      ],
      [
        "m",
        "o"
      ],
      [
        "y",
        "ada"
      ],
      [
        "Ġ",
        "1"
      ],
      [
        "ee",
        "d"
      ],
      [
        "ar",
        "kii"
      ],
      [
        "Ġs",
        "ha"
      ],
      [
        "ha",
        "t"
      ],
      [
        "Ġw",
        "ar"
      ],
      [
        "aan",
        "ka"
      ],
      [
        "iy",
        "ay"
      ],
      [
        "Ġt",
        "ar"
      ],
      [
        "Ġda",
        "r"
      ],
      [
        "si",
        "ga"
      ],
      [
        "eey",
        "ay"
      ],
      [
        "ob",
        "o"
      ],
      [
        "Ġqo",
        "f"
      ],
      [
        "h",
        "ii"
      ],
      [
        "k",
        "ay"
      ],
      [
        "l",
        "ay"
      ],
      [
        "s",
        "ad"
      ],
      [
        "u",
        "q"
      ],
      [
        "Ġ",
        "B"
      ],
      [
        "aa",
        "da"
      ],
      [
        "ay",
        "o"
      ],
      [
        "oo",
        "y"
      ],
      [
        "Ġku",
        "w"
      ],
      [
        "Ġq",
        "ab"
      ],
      [
        "Ġda",
        "d"
      ],
      [
        "Ġda",
        "lka"
      ],
      [
        "ĠMar",
        "ey"
      ],
      [
        "Ġ2",
        "0"
      ],
      [
        "h",
        "aa"
      ],
      [
        "i",
        "a"
      ],
      [
        "u",
        "d"
      ],
      [
        "Ġ",
        "K"
      ],
      [
        "aa",
        "c"
      ],
      [
        "Ġs",
        "id"
      ],
      [
        "Ġs",
        "am"
      ],
      [
        "Ġd",
        "aa"
      ],
      [
        "Ġay",
        "uu"
      ],
      [
        "Ġx",
        "ar"
      ],
      [
        "ĠMarey",
        "kanka"
      ],
      [
        "a",
        "hay"
      ],
      [
        "e",
        "h"
      ],
      [
        "h",
        "iin"
      ],
      [
        "l",
        "k"
      ],
      [
        "s",
        "ha"
      ],
      [
        "Ġ",
        "ga"
      ],
      [
        "Ġ",
        "gu"
      ],
      [
        "Ġ",
        "na"
      ],
      [
        "aa",
        "f"
      ],
      [
        "aa",
        "g"
      ],
      [
        "ay",
        "ay"
      ],
      [
        "ee",
        "l"
      ],
      [
        "ii",
        "s"
      ],
      [
        "Ġin",
        "ay"
      ],
      [
        "ad",
        "d"
      ],
      [
        "Ġwax",
        "aana"
      ],
      [
        "Ġy",
        "iri"
      ],
      [
        "Ġsh",
        "arc"
      ],
      [
        "Ġha",
        "dda"
      ],
      [
        "Ġshee",
        "g"
      ],
      [
        "ĠSoomaal",
        "ida"
      ],
      [
        "d",
        "o"
      ],
      [
        "i",
        "j"
      ],
      [
        "j",
        "in"
      ],
      [
        "k",
        "h"
      ],
      [
        "n",
        "ad"
      ],
      [
        "r",
        "ea"
      ],
      [
        "u",
        "b"
      ],
      [
        "x",
        "da"
      ],
      [
        "oo",
        "da"
      ],
      [
        "ee",
        "da"
      ],
      [
        "Ġs",
        "ii"
      ],
      [
        "Ġw",
        "ada"
      ],
      [
        "Ġwax",
        "a"
      ],
      [
        "Ġy",
        "ee"
      ],
      [
        "Ġdha",
        "q"
      ],
      [
        "Ġsi",
        "da"
      ],
      [
        "iin",
        "ta"
      ],
      [
        "im",
        "aad"
